{"podcast_details": {"podcast_title": "The Game Football Podcast", "episode_title": "Can The Lionesses Lift The World Cup On Sunday?", "episode_image": "https://assets.pippa.io/shows/61ba0e501a8cbe71d83cf13e/show-cover.jpg", "episode_transcript": " Parenting is a wild ride. One minute, they're demanding a banana. The next? They're mad because you gave them one. Therapy can help you navigate these ups and downs, and BetterHelp makes it easier to get started. Fill out a brief questionnaire, match with the licensed therapist, and switch therapists anytime for no extra charge. It's 100% online, convenient, and flexible enough to suit any schedule. Visit betterhelp.com forward slash parenthood for 10% off your first month. Hi, this is Shannon Storms-Bidour, Real Housewife of Orange County and entrepreneur. When my company, Real4Real, started selling our health products online, we really struggled to find a way to ship our orders out quickly and without error, until we started using ShipStation. ShipStation's simple dashboard makes it easy to automate shipping tasks and effortlessly manage your orders from every marketplace, including Amazon, Etsy, Shopify, and more. Print shipping labels, easily compare rates and delivery times, and take advantage of discounts up to 84% off USPS and UPS rates. And with enterprise solutions that make warehouse optimization easy, ShipStation scales when your business does. No wonder 98% of companies that stick with ShipStation for a year become customers for life. Spend more time growing your business and start automating shipping tasks with ShipStation. Go to shipstation.com slash audio today and sign up for your free 60-day trial at shipstation.com slash audio. Hello and welcome to this very special episode of The Game podcast from the Times. Special because this show is in addition to our usual Monday and Thursday offering, but even more special because England are in a World Cup final. That's right, finally, first time since 1966. This time it is England's women who will face Spain in the World Cup final on Sunday. Joining me, Tom Clark, I'm currently in a small room in the Times office in London. We've got two of our intrepid reporters down under. They might be a bit bleary-eyed and ready for bed, but they're here with you now on The Game podcast. It's Molly Hudson and Owen Slott. Molly, how are you doing? How are the energy levels? Do you know what? I've just ran back to my hotel from England camp, from a train actually. I can't run the however many kilometres it is to camp. And it's absolutely pouring down with rain. We've just ran along with pizza boxes on our head. So that is the real life of a Women's World Cup reporter in Australia right now. You've had pizza tonight. God, you count yourself lucky. It's been much tougher where I've been, Tom, I tell you. I haven't really had time for food really, for refueling. I've just been filing words to keep our readers happy. I've been tuning my voice so I can sing to the Backstreet Boys of Molly Hudson because every half time she sings the Backstreet Boys to me. That's the way they play at half time. And I just kind of feel I've let her down by not singing well enough. Well, that is true. I was fascinated by this revelation in our live coverage of England's win in the semi-final. Slottie, you revealed that Molly was singing the Backstreet Boys. I mean, it begs the question, what song was it? Christmas, Molly, what song was it? I know the tune, but I'm not quite sure on the song titles. I don't know. Is it called I Want It That Way? Oh, Molly, see, this shows the age differential potentially between you two. Someone who maybe missed the Backstreet Boys by being a couple of years older than their time. And also Molly, who probably has no idea most of the songs are the Backstreet Boys. I Want It That Way is absolutely iconic. And so if England's success has been inspired by that song, there's absolutely nothing wrong with that. Now, as we're talking about that semi-final, there's loads for us to discuss about Sunday's final against Spain. But I want to go back, Molly, that final whistle, as well as furiously filing your copy for the match report for the Times website, which was brilliant, by the way, I would recommend any young reporter who wants to learn how to file on the whistle very quickly to go and check it out. Molly, what were the emotions at full time, England in a final? Relief, both the England winner final and I filed my archiport on time. It was a strange one, I think for me personally, I was at 2019 when England played the United States, who obviously were the bleeding power of the women's game. And of course, things went against England in that game. There was, you know, Steph Horton's missed penalty, Ellen White's offside toe. But in truth, you know, the United States outplayed us. They were a better team. They were more prepared to get to that stage. So I think when the final whistle blew, it was a sense of relief, but it was also a sense of kind of this is what this team have worked for. This is what they've built for and they looked like they belonged on that stage. I mean, of course, you can argue that in other tournaments, perhaps you would have faced a more difficult team than Australia, purely in terms of footballing talent. Obviously, they were an interesting test because of the host nation element. But I think, you know, England, as stressed as naturally you are watching England play at a major tournament, I think they were, you know, pretty in control, even when Sam Kerr scored the equaliser. Obviously, a huge moment, a huge noise. I think England just kept remarkably cool. And I think this more and more so as the days go by, feels like it's their time. Yeah, I mean, it's interesting you talk about that being their time. Slotty, you wrote after the semi-final about this. You described a rare efficiency was the words used in the headline of your piece. Tell us a bit more about that, because, you know, in your career, you've seen various different England teams across different sports and also, you know, Olympic Games and things, athletes in big moments meeting what was required, but also falling short. What is it about this England team that makes them so special, do you think? Yeah, the rare efficiency is a strange compliment because, well, it's rare because England teams, efficiency is kind of like a German adjective, you describe German teams, I'm using stereotypes here. England teams can flatter to deceive, and we're talking massive generalisations about England teams and English sports people. But the idea that this team are like finding a way to win, that they are not panicking remotely when stuff goes against them, because it always does, you know, that's what these tournaments are about. And there's been so much that's gone against England on and off the pitch. It's incredible. And their unflappability, which clearly comes from the lady on the touchline, is really notable. And maybe we'll talk about 2003, and I'm sort of a bit obsessed with 2003 because I was here then. But again, that was a team that kind of knew what they were trying to achieve and how they were trying to get there. And they had this composure, a similar composure to what this England team has. And Lord knows how it will play out on Sunday. But I just think one thing you can be sure is that England won't lose their heads. If they make a mistake and concede a goal, then they won't suddenly concede a second goal. They'll dig in and fight back. All those kind of attributes that you would want in a team at this point in a tournament. Yeah, I mean, you talk in your piece about that Rugby World Cup winning side and it being in the same stadium where Johnny Wilkinson hit the drop goal 20 years ago. Just going back to that kind of composure, obviously Molly has followed this England team a lot. You have at this tournament, what has been your sense of Serena Vigman and how much of that composure stems from her, Slotty, in terms of her manner in the press conferences to reading her body language at different times? What have you made of her as a coach in comparison to say some of those other coaches and mentors that you've seen throughout your career? Yeah, one of the things that is so striking is the manner and the aura in which she inspires in her players, the trust that they place in her. It's a total belief thing. And that's great if you're backing the right person, which they clearly are, that's great. She's got them in the palm of her hands, which is great. I'm fascinated by this thing about the calm coach on the side because most of this year we've been admiring a coach who's completely and utterly the opposite extreme in Pep Guardiola, you know, the frantic John Cleese kind of take off on the touch line. How can arguably the two greatest coaches from the men's and women's team be so polar opposites? I don't know, but both get the job done in a different way. One thing about Serena is she's obviously tactically really, really, really astute. And that's clearly one of the things that helps inspire her players. But pretty much every call that she's been making here seems to have gone her way. You know, every time you think that she should make a change or something or she should do something, she comes out on top. The Nigeria game I go back to when she needed to make a change and she didn't. That sort of stands out because it's the one time when you go, actually, maybe she didn't get it right. But pretty much everything else seems to have gone her way. When you talk about that motivation, I thought it's one of the moments of the tournament for me was watching her deliver her post-match kind of pep talk, if you like, with all the players huddled around, Molly, on the pitch after the final whistle in that semi-final. Tell us a bit more about that, those moments, you know, insights into that. But also then growing forward, what's the mood like being in the camps, you know, for the last 24 hours? To be honest, I didn't see the huddle because obviously I was here and I didn't see the TV coverage. But I do have quite a funny anecdote from the mix zone, actually. Actually, it's probably Slotty's story, but I'm going to take it anyway. One of the journalists, possibly Slotty, possibly Ian Herbert, was asking some of the players what had been said in that huddle because very similar to you, they'd picked up on it on the TV. Obviously, we kind of had no idea. And Lucy Bronze was sort of detailing little bits, like, you know, she was saying we deserved it, blah, blah, blah. And then she says, she saw me jumping up and down and told me off and said, leave that to the young ones. We need you to look after yourself. That kind of glimpse of Serena really is what you see. I think when we see her in the media, it's not something she enjoys. You know, you can see she enjoys the touchline, being close to the players, the tactics, that side of it. She doesn't enjoy the sort of performative nature of the job in a lot of ways, especially when, unfortunately for her, you're as successful as she is. Sadly, she's only going to see more of us. I think that's when you see the glimpses of that relationship with the players, that she isn't always that kind of quite cold, direct person that she can sometimes appear in the media. Actually, there's clearly a softer side and all of the players would absolutely run through brick walls for her. And they do so again and again. And I think that's what kind of shows the strength of this team, really. Tom, just one thing that I found really hilarious about this whole Serena thing is the way that as the England coach and leader, she's had imposed on her the storylines that go, that accompany that. So at the start of the week, she had the storyline of the Australian rivalry and she was asked to comment on it. And she's just completely baffled by it and sort of smiles and looks perplexed, but won't play the game partly because she can't, but also because it's not in her nature to sort of entertain all this silliness for the sake of the media. So they dispatch Australia on Wednesday and then immediately in her next press conference, it's like Serena, 57 years of hurt. How do you feel about bringing that to an end? Has it been an agony for you as well? And do you feel our agony? And again, she just looks at the media like silly children. You and your funny nonsense that you go on about. She rises above it and doesn't engage. And it's just funny because it exemplifies the storylines that we live with and sometimes how preposterous they can seem to other people. Yeah. Well, having seen some of the plans for previews over the next 48 hours in The Times, I can tell you there's a lot more of the 50 odd years of her 1966 references coming your way, Serena, I can promise you. One of the things that Vigman will surely be asked about over the coming hours and days is Lauren James and the selection problem that her return to availability presents to the England manager. Molly, you caught up with our star columnist, Casey Stoney on this subject and more. Here's what she had to say. I think it's hard because you've got a super, super talented player that you know that can hurt Spain. But you've also just had a player that scored an absolute worldy to get you one lap in a huge game. I thought Ella Toon actually had a decent performance in there and caused problems. So I think I would probably stick with Ella and make it very, very clear that Lauren, you're going to have a huge impact in this game when you come on. I know usually Lauren's not necessarily been a great impact sub, but this is a World Cup final. She hasn't been left out of the manager's choice. It would be because she's missed the previous game, because she's had all the previous two games and she's obviously had a red card. So this is a very different role for her in terms of taking it on. I think she would take it on. I also think bringing her on when those Spanish legs are a little bit more fatigued could be very, very dangerous. It's an unbelievable bullet to take to have off the bench in terms of what she can fire at the Spanish team. And do you think that that's also what Serena will do? Because I guess in the past we've seen her make bold decisions. She dropped her captain, the Netherlands, obviously she she dropped Steph. What do you think her brings to that decision? Very interesting. I had this conversation with someone earlier and I said she doesn't make decisions on sentiment at all, ever. You know, she makes decisions that she's right for the team. I think she could go with Lauren based on that. I think Ella could be used as an impact sub. So I wouldn't be surprised to see that because she makes decisions that she thinks is right in the moment. And she'll be looking at training, she'll be looking at performances, she'll be looking at who can play in that role and serve those fronts to the best. Ella's performance last night has definitely put her in consideration. And we've talked about LJ and that emotional development. How do you even write a story like this where you think the tournament's over and then they literally make history for you to have a chance to come back? What must that be like? And how would you kind of, I know it's easy to say for us who aren't in it, but kind of advise on how to even deal with that mentally? She's got to win her. She's got to win her. Honestly, that's what I believe. I think she'll come on or she'll start and she will have such a hungry determination to make things right that she'll have an impact in this game massively. I don't doubt that for one second. And then I think the story will write itself. You know, she would have learned a very hard and fast lesson from what happened. And I think she'll want to put a few wrongs right. And she's got the talent to be able to do it. Casey Stoney there with her insights and advice for Serena Vigman ahead of England's big final. You can read her column online now and you can read her reaction after Sunday's final. Molly, I want to come to you on Lauren James. Obviously, it's a big talking point. She burst onto the scene in this tournament, then was sent off and has missed the last few games. Ella Toon put in a brilliant performance in that semi-final. Where do you stand on the debate? Casey says she would start Toon but thinks Vigman will pick James. What do you think? I appear to have been thinking about this since the full-time whistle went actually. I'm yet to come to a proper conclusion really. I think deep down, I think Serena will pick Lauren James because I just... We talk about Serena Vigman and her past. She dropped the Dutch captain and that was it. She dropped Steph Horton, England captain. That was it. There's no coming back. It's not as though she operates with any sort of sentimentality as Casey pointed out. I don't think the fact that Ella Toon scored that fantastic goal will matter in this lightest. She will just pick the team that she best thinks beats Bain. I actually think it's quite interesting looking at how both of them might operate as substitutes. I don't think Lauren James is a particularly good substitute. She's somebody that needs to find her way in the game. I don't think she's necessarily somebody that you'd want to bring on if you were to say one goal down and just immediately need her to score. I think she needs a little bit of time to figure things out. I think actually Ella Toon proved a very good super sub in that Euros win. I think in that sense, I wonder if she may go with Lauren James from the start. I think the other thing that we have to remember is this incident showed us that Lauren James is an absolutely massive talent, but she's also pretty emotionally immature. She's a very young player. We're all talking about it now on the eve of the World Cup final. Imagine the kind of emotional roller coaster that she herself has been on over the past couple of weeks. I think that ultimately is something that we can't answer. I suppose only Lauren James and Zarina Wigman will truly know where James' head's at. I suppose for a young player that has so much talent, that's the thing that has to be the most important here. What is the best for the team, but also what is the best for a player? Because whenever she does come onto that pitch, she knows the eyes of the world are going to be looking at her. Sotty, would you agree with that? I think there is an element of Wigman having to factor in the pressure that James will be on in comparison to say, she just names the same team, we won the semi-final, away you go, winner's the final. Do you think that's a factor in this decision? Yeah, it is a factor. In my opinion, she should just put Lauren James in full stop. Well, not full stop, because the point that Molly's making is we don't know how Lauren James is. We haven't sat in camp with her for the two weeks since she got sent off. So I don't know how emotionally vulnerable she is. But if she's emotionally strong, then I just think you have to go with her because she's so good. The idea that you hold someone that good back because you might need to rescue the game or make a late change, I don't really buy that because I would just rather have her on for a whole hour or 75 minutes beforehand to win the game and not need to have that problem. So that's my take, but just as Molly says, what her state of mind is, no idea. I wanted to ask you both about the England support in Australia. Molly, we touched on this before the semi-final. We talked about the imbalance in England having to play against a home crowd. Have you met any England fans? Have you met many England fans? What has it felt like? Because sat in this office, I've just been in a meeting, there was 20 people strong talking only about the final. It's the only story in town. All my friends, family are all asking me what you're doing on Sunday. I'm working. Oh, bloody hell, we're going to go round to BlaBla's house. We're going to sit and watch it. It's manic here. Everyone is obsessed. What is it like over there? You know, you've both covered different tournaments before. Is there a growing band of England fans? Are they all kind of expats who are kind of finally sticking their head above the parapet going, hey, we're English and we're proud? What's the kind of mood in Australia like from an English point of view? I think it is a bit strange, as you say, when you're kind of out here and you're not in the bubble. I think in a way it probably kind of helps the players a little bit because they're, although, of course, they it perforates the bubble in some ways. You don't feel the full force of that pressure in the same way that you do when you're hosting a tournament. I think certainly compared to my experience in 2019, there's a lot more travelling England fans here. And I think that is a combination of both expats and also travelling fans. There's a group called Freeline S's who have organised a lot of the meet ups and things that have been going on. And certainly for the England-Australia game, actually, I obviously we get to a stadium sort of like three, four hours before kick off. And there were there were like several England fans that I walked into actually leaving the train station here. And they were really loud. In fact, it's quite strange. I think Slotty would happily talk about this, the fact that quite often in men's football, you have these established chants and you don't really have that in women's football. You have the initial sort of roar of a crowd and then it sort of dies off when the play starts and then they cheer for a goal. I think Slotty would say that's been a little bit strange to somebody that's maybe more accustomed to men's football. But certainly in terms of numbers, there's a decent amount out here. I think there was there was room of about eight thousand out here. Obviously, possibly not all in the stadium against Australia, of course, but there's a fair number out here. I don't I don't feel Tom again. I'm going to do the old blokes thing. And I was here in 2003 and 2003, the week leading up to the final, the you could sort of feel the city filling up with with English men, mainly men. And the numbers that got on planes from from London or from the UK to get over for one game, I think it was something like forty thousand that were here in the end. And it's not like that. And I think that's that doesn't mean anything apart from reflects on the fact that, you know, English rugby has had a big building of following for much longer than than the Lionesses have. There are numbers here. And I think part of it is because the way it is changed is up to Wednesday. It literally felt like the tournament was about the Matildas of the Australian team. And I think that it was very hard to get tickets for the semifinal. It was almost all green and gold. So I'd be really interested to see how much that's going to change. Hopefully, it will change dramatically. Yeah, absolutely. And Molly, by the way, if you were looking for women's players specific chance, how you've not come up with it's Georgia standway to the tune of I want it that way. Quite frankly, I don't know what you've been doing the whole time you've been there. There's still plenty of time for you to win that one. I'm sure I'm going to work on the lyrics. I'll send you the full thing. Don't worry. Moving on, we're talking about Australia there and fans and support. I want to talk about Spain, a fascinating team, Molly, in terms of the story, a little rivalry with England having faced each other in that Euros match, which I think we've been talking this week. We can all agree was probably England's most difficult game in the Euros. Just coming through 2-1. Tell us more about them because they've not had the ideal build up in this tournament, have they? And not just build up, the kind of unsettled nature of their camp has gone all through the tournament, hasn't it? Yes. Hopefully there will be a piece from me on this on the Times website at some point soon. I have just written it. Lucky readers. So I will try and give you a taste of it's rather complicated situation really. Essentially, last September, 15 members of Spain football generally went on strike against the federation. They complained about a number of issues relating to little things like, well, not little things, quite big things actually, travel, the standards, details like they were having to get buses for long distances when there were flights available. The federation were not really investing in things like nutritionists, fitness experts, which obviously we know is an area where England have improved greatly in recent years. They had issues with the way the Jorge Vilder, the manager, coached essentially and the fact that they felt he was quite controlling. And this kind of rolled on and on. The federation publicly come out and said we shouldn't have players detracting from the coach. They've been very in support of Vilder. This is this is rolled on and on until the squad announcement for players, including Patrick, who is arguably, I think if you ask Kiera Walsh, who she plays alongside at Barcelona, will tell you is probably the best midfielder in the world. It has decided to make herself unavailable for the squad. There are four players that have done that. There are also 11 or 12 players that had a shout of being in the squad. They might not have all been starters, but a few of them were a couple of players from Manchester City, Manchester United. And then three of the 15 that initially went on strike have come back into the squad. And that's Ona Batia, who is the Manchester United right back that's just moved to Barcelona, Mariona Caldente and Itana Bonmatti. And all three of those players are probably going to start against England. They're three of their very best players. And they've caused quite a lot of controversy in Spain and sort of globally, women's football, really, because it's quite divided, because some people feel these players have made quite a selfish decision to come back into a federation that many believe doesn't treat their players properly. They've put a manager that is not the best for this team. They've put their personal goals ahead of the team and the idea of going on strike and trying to change something. And then obviously there are other people that say, well, you know, these are teams that players that this could be their last chance to play at a World Cup. You know, it is a very complicated situation. And I think in the aftermath of the Netherlands Spain game, it had gone to extra time. Everyone was jumping around, hugging each other and there was a clip that went viral on X, as it is now called, of Jorge Wilder just looking slightly lonely and bewildered as everyone else celebrated around him, sort of avoiding him. It's a very strange scenario and one that makes you feel as though these players are possibly playing in spite of him trying to make history for themselves, for their teammates, for their country, not in the best circumstances at all. I think it's quite an interesting dynamic when you consider, as we've discussed earlier on in this podcast, about the real togetherness in the England squad and that really coming from Serena Wiedman and her relationship with the players, really, you couldn't have a more opposite opponent in that sense as to the kind of turbulence that Spain are experiencing at the moment. I mean, it certainly sounds like the complete opposite situation to England, but we shouldn't get too carried away. Listeners shouldn't be thinking, well, we've got it sewn up. This is a strong team, isn't it? Despite those players, like you mentioned, are missing. Mol, who are the couple of players that, you know, if you're tuning in maybe to watch Spain for the first time in this tournament on Sunday, who should you be looking at and thinking, oh blimey, hope they don't get hold of the ball. Quick, Lucy Bronze, get the ball off them, quick. I think Ona Batia is a massive danger from right back. She's probably one of the best right backs in the world, probably kind of actually trying to stake that game off Lucy Bronze, who has obviously now come to the end of her career. But Mati, who I just mentioned, another one of those three that have come back is, you know, there was actually discussion as to whether part of the thinking behind her coming back was that she could well win the Ballon d'Or this year if Spain go on and win this tournament, having been part of the Barcelona All-Conquering team. So there's a huge number of players. It's a little bit crazy if you imagine the England team without 12 of its players, we'd have nothing. But Spain just have such incredible depth that you almost barely notice. And that's not taking away from anything from these players that have made this very brave decision not to play in this tournament. But it just does to show how difficult it is. And actually, Casey made an interesting point when I was speaking to her earlier on. She said, well, yes, Spain are missing those three players. And seemingly that gives an advantage because those three players played in the Euros game that obviously England won. But England are also missing three players. They're missing Leah Williamson, they're missing Beth Meade and they're missing Frank Kirby. So in that sense, it's quite even in a way that it should be as even, as close, as tightly contested as that game in the European Championships was. But it's not going to be any easier for sure. I mean, they're a fascinating subject, Molly, as you say, and listeners, make sure you check out Molly's piece that she mentioned. That'll be on the Times website. By the time you're listening to this, there's loads of other preview content out there as well. We'll be speaking to Phil Neville over the weekend. Slotty, you'll be writing as well ahead of the final. There's loads of brilliant stuff. So make sure you check it out. Finally, I'm going to let you both go to bed and get some much needed rest. But Molly, you've teed me up perfectly by talking about how difficult that game is going to be for a prediction. Now I'm going to go first. I'm going to say that England are going to edge it 2-1. And I feel like there's a big moment coming for Lucy Bronze. She's not, she's had a few little moments here and there in games, but I feel like there might be a Lucy Bronze screamer coming. So I'm going positive, but I'm also factoring in that difficult Spain opposition saying it's going to be 2-1. Slotty, prediction, please. I was really struck by the comments of Lucy Bronze and Keira Walsh, the two England Barcelona players who I spoke to after the game yesterday. The extent of the compliments they heaped on the Spanish team. Lucy Bronze said that the Spaniards were technically the best players in the world, which is kind of extraordinary to be so confident about your opposition so close to the final. So I bear that in mind and also bear in mind what we were saying before about this England team that have so much going for them, the will to win, the composure. And they're also a very good team as well. My prediction is one all penalties and England win on penalties. Oh, goodness me. Speaking as the person who's editing on Sunday, please God let that not be the case. And I can see on my webcam that Molly Hudson is rocking back in her chair thinking, please God no. So Molly, I'm going to give the final word to you and I can only presume you're going to predict a 4-0 win. I was actually going to predict what you said. A combination of the two of you really, a 2-1 England win. I think England go behind first. They show that resilience. And I think Keira Walsh has a massive say in the game. There's been a lot of talk about how she hasn't actually had a great tournament, but arguably she's England's best player. And I think your best player, they have to step up on the big stage. And I think knowing how well she knows a lot of this team, I think this could be a moment to shine again just as the Euro's final was. I certainly hope so. But the point is we're all predicting it's going to be pretty tight. So make sure you're watching and then make sure you're following all the Times coverage. We'll be covering the final live on the Times website and then straight after full time you'll be able to read Molly's match report and insight from Slotty as well, as well as loads of other content besides Molly Hudson, Owen Slott. Thank you very much for joining me. I'll let you get to bed. Join us on Monday. We'll be reacting to all the best of the weekend's action and to the World Cup final. Thanks for listening. I'm Charlotte Ivers, the political correspondent at Times Radio and a columnist for the Sunday Times. Every day I'm searching for the humor in the comings and goings of our political masters and hopefully trying to hold them to account along the way. I wouldn't be able to do this without the subscribers to the Times and the Sunday Times. Subscribe today and only pay one pound for three months. Visit thetimes.co.uk forward slash podcast offer. Terms and conditions apply."}, "podcast_summary": "Thank you for listening to The Game Podcast from The Times. To get the latest news, insights, and analysis from our award-winning team of journalists, subscribe to The Times and The Sunday Times today. And enjoy one month free. Visit thetimes.co.uk forward slash thegame.", "podcast_guest": {"name": "Not Available", "org": "Not Available", "title": "Not Available", "summary": "Not Available"}, "podcast_highlights": "Here are the five highlights from the soccer podcast episode:\n\n- \"When the final whistle blew, it was a sense of relief, but it was also a sense of kind of this is what this team have worked for.\"\n- \"The rare efficiency of this England team makes them so special.\"\n- \"She's got to win her. Honestly, that's what I believe. I think she'll come on or she'll start and she will have such a hungry determination to make things right.\"\n- \"Their unflappability, which clearly comes from the lady on the touchline, is really notable.\"\n- \"She just looks at the media like silly children. You and your funny nonsense that you go on about.\""}