{
    "podcast_details": {
        "podcast_title": "The Redmen TV - Liverpool FC Podcast",
        "episode_title": "'He Is Destined For Greatness' | Japanese Football Expert On Wataru Endo",
        "episode_image": "https://assets.pippa.io/shows/611e92b606c05e0b50f40b2b/1690990897253-e40b80a0b7000be13885d70c5fbd40d4.jpeg",
        "episode_transcript": " Love this podcast? Support this show through the ACAST supporter feature. It's up to you how much you give, and there's no regular commitment. Just hit the link in the show description to support now. Parenting is a wild ride. One minute, they're demanding a banana. The next? They're mad because you gave them one. Therapy can help you navigate these ups and downs, and better help makes it easier to get started. Fill out a brief questionnaire, match with the licensed therapist, and switch therapists anytime for no extra charge. It's 100% online, convenient, and flexible enough to suit any schedule. Visit betterhelp.com forward slash parenthood for 10% off your first month. Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the US. Over 15 million this year alone, and many don't even know their victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated US-based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25% their first year at lifelock.com slash ACAST. Identity theft protection starts here. Hello, everybody, and welcome to Redmond TV and your latest edition of Transfer Insight. My name is Dan Club, and I'm delighted to say I'm joined by sports journalist for the Japan Times, Dan Aldewitt. Dan, how are you doing? You okay? I'm good. You know, fellow Dan, it's talking football. It's a good time, good place, and what an occasion. Wow. I know, yeah, what an occasion indeed. But yeah, obviously I was looking for somebody of expertise in the Japanese sport, of expertise in the Japanese footballing world, of course. And when I came across yourself and fellow Dan, it was a no-brainer, really. It was an absolute tap-in for me. I couldn't not send that message. And yeah, of course, what a time. Liverpool, rather shock signing, I think. It's very much on the brink of happening. We're expecting the announcement imminently at time of recording. I don't think we're far away at all. But yeah, Wataru from, Wataru Endu from Stuttgart, of course, Japan captain, Stuttgart captain as well. Let's talk a little bit about him. While we've been talking on Twitter, sort of arranging this, you described him as a natural leader to me. So yeah, describe him, I suppose, to start off with, as a player and sort of what Liverpool could be getting, because you will have covered him for quite some time, I would imagine, sort of his development from the youth, thanks, and how he's now become to be the Japanese national captain. So how has that development happened? Yeah, so he came up at BMA under Chokri-J, who is the, he was the youth manager at the time. And then became the top team manager and just had a really good sense of producing youth talent and developing local players. Because Shonan are a very small club in terms of resources, in terms of the fan base. One of the J-League's older clubs, known, probably best known among European fans for producing Hideyoshi Nakata, one of Japan's greatest players of all time. And so that's sort of the pedigree you're looking at. And he spent several seasons there. He did move to Urawa Reds at the end of 2015. And that was sort of an expected move to a bigger club. Urawa are one of the biggest clubs in Japan. That means to be Shimoni, a giant stadium, huge fan base. And from that point, you know, he played there. I've seen him sort of described, a couple of fans sort of jokingly described him as an Urawa legend, but the reality is he played most of his games at Shonan. And Europe was always an inevitability. And he did that through St. Troiden in Belgium, which is a landing pad for Japanese players. They're owned by a Japanese company. And so we've had many Japanese players go through there. Takehiro Tomiyasu, Daichi Kamada. You know, these are players that you're seeing in the Premier League now, in Serie A, coming up this season. So he was always sort of destined for greatness. But when I talk of him as an absolute leader, I think that the player you have to look at before him is Makoto Hasebe, who was Japan's longtime captain, played at Wolfsburg, has played at Frankfurt for however many years, and he's in his late 30s and still going. When he retires, I think he's gonna take up a coaching position there. And Hasebe was always not necessarily the star of the team. And by the team, I mean Japan, but that natural born leadership, that commanding presence, that sense of control. He is what we describe, the word that's used to describe players like them are sort of control towers, like in the airport. They're the ones directing traffic. They're the ones setting up everything. They're the ones who are rallying the team in a sort of emotional sense, but also on the pitch, they're the ones setting the ball where it needs to go. And Ndo is much more of a defensive player. He did start his career as a sort of as a center back. And then around when he went to Europe, around when he became more involved in the national team, he shifted to a more sort of central defending midfielder position. That's where he's played a lot of time over these last few years. So my understanding is that I think Liverpool are in need of reinforcement. There's a few possible places he could slot into. So I'll be really curious to see where he could go. But he's just got this presence, he's unflappable. And I think you look at this Japan team right now, Kaworu Mitoma may get the headlines, especially overseas, but like Ndo is one of those gears that keeps the team going. He's the engine, he's at the center of it all. And I think without him, this Japan team would be a lot weaker than it is. Yeah, absolutely. You mentioned there sort of the well trodden path to go to Belgium and then obviously make a step to Germany. Have you seen sort of his performances for the national team? I think he's got 50 caps now, obviously like I mentioned earlier, he's Japan captain. Have you seen his performances for the national side improve over time, sort of while he's made their moves, he's made them steps in his career? Have you seen improvement in him? Yeah, I think that he is, you know, if you look at the setup of the national team and the depth chart, I think that he was sort of a natural to fit into that midfield position. Because again, it just, you look at him and it's so much like Hasebe where he's not the tallest player, but he's so strong on one-on-ones, on duels, on his positioning, his vision, his ability to force those turnovers and get the ball and then distribute it. And he's just maybe not necessarily a playmaker in the sort of attacking way, but just what he does in midfield is so important. And it's especially important for this Japan team because you do need someone who can create those chances in midfield and then get the ball to one of our attackers, which Japan has many attacking midfielders who are all capable of doing things. Obviously, Liverpool fans saw Takumi Minamino for a few seasons, but he's definitely, he's not, again, he's not a star, but he's a core component. I think anyone who's paying attention to this team understands how important he is and how important he's become. And he's, I think, 30 this year, but that tends to be in many ways the prime of careers for a lot of Japanese players and the more sort of midfield defensive backline. Parenting is an epic journey of highs and lows. Therapy can help you navigate it all and take care of yourself so you can be the best parent possible. And better help makes it easy. Complete a brief questionnaire, match with a licensed therapist, and switch therapists anytime for no additional charge. 100% online and designed for maximum flexibility. Get started at betterhelp.com forward slash parenthood for 10% off the first month. Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the US, over 15 million this year alone, and many don't even know they're victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated US-based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25% their first year at lifelock.com slash ACAST. Identity theft protection starts here. At Consumer Cellular, you get the same exact coverage as the largest carriers, but for up to half the cost. Same thing, up to half the cost. Up to half the cost for the same thing. 50% the money for 100% the same thing. I hope I'm making myself clear. Consumer Cellular, when Freedom calls, we're here to answer. Call us at 1-888-FREEDOM. Half the cost savings based on cost of Consumer Cellular single-line 5GB data plan with unlimited talk and text compared to lowest cost single-line postpaid unlimited talk, text, and data plan offered by T-Mobile and Verizon May 2023. So yeah. Yeah, that makes perfect sense. I wanted to ask you as well, obviously, like I say, he is now the Japan captain. Was he always a leader in that side? Was it quite a natural appointment, I guess? Was there any sort of complications around it, or was it always likely to be him at one stage? You mentioned some of the star players there, for example, and was Ender always the perfect fit for the role? So he's taken over the captain. He captained the captain's position at the Rio Olympics in 2016. And Japan has had a long string of captains, or sort of a distinct, it wasn't a question of the armband moving from game to game or from tournament to tournament. There was Makoto Hasebe, and then there was Maeya Yoshida, who has sort of stepped back from the national team picture following Qatar. And I think Endo was the captain of the team. And I think he was the captain of the team. And I think Endo was always going to be next. Maeya Yoshida, you can't replace his presence in a way. And Hasebe, he stepped down from the national team after 2018. And they were always sort of the strong, unflappable veteran presences. And I think that that's a natural path for Wataru at this point. He's just got that sense of leadership. And I think that you need someone steady. I think for the captain's role, you don't need a superstar. You need someone who's... I think it's more important that you have someone who has the respect of his fellow players and the coaches. And I can't think of anyone better with the squad that we have at the moment. No, absolutely. Yeah, you mentioned the word respect there. And also, Liverpool didn't have a star in their captain. And a good player, Jordan Henson, very good player. But the ultimate professional, as you say, he got the utmost respect from everyone, including the management and the teammates, of course. But I wanted to ask you as well, Dan. He's seen, it appears, a bit of a fan favourite, a bit of a cult hero at Stuttgart, certainly. In terms of the Japanese fan base, do they adore him? What's his popularity like over there? I think he's, again, respected by fans. He certainly has a following, although I don't think that he has as fanatical a following as, say, Minamino, who, because he came up through Setasuo Osaka, they have a much more, how do I put this? Yeah, the young players that come up through Setasuo Osaka are more like pop stars, in a way. Not to dive too deep into Japanese culture and fandom and all that stuff. But you look at players like him and Shinji Kagawa in the past, who, of course, played for Manchester United. And those are all Setasuo players who have that boy idol sense to them. And that's not, I think Endo is more the player that, especially at Shonan, which does have an older fan base compared to some of the other J-League clubs. I think those fans, they treat him like their son, in a way. And he is. He's a local boy, a Kanagawa local, who joined the team at a young age. And he came up, and he may have gone to a couple other clubs. But he's representing Shonan in Europe. And I don't know if they'll be getting a solidarity payment through this deal. But that would be a big benefit to the club. And it is a point of pride that Shonan Belmaré, a club that doesn't have the resources of Urawa, of Kawasaki, of Yokohama, of Nagoya Grandpas, that they can still produce players who are capable of now going on to Europe and succeeding there and joining Liverpool, potentially, maybe even in the next few hours. So I think that this will be seen as a big accomplishment for Japanese football. In a summer of them, we've had something like 15 Japanese players go from the J-League to European clubs this summer. But this will be probably the biggest move of them all. I mean, Europe to Europe. But still, this is big news for the Japanese football scene. Support for this program is provided by Chevron. Demand for energy is projected to reach a record high in 2023 and will continue to rise in the future. To help keep up, Chevron is increasing their US oil and gas production. And they're aiming to do it responsibly across their US operations, including their Gulf of Mexico facilities, which are some of the world's lowest carbon intensity operations. Helping supply energy that's affordable, reliable, and ever cleaner. That's energy in progress. Learn more at chevron.com slash energy in progress. Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the US, over 15 million this year alone. And many don't even know they're victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated US-based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25% their first year at lifelock.com slash ACAST. Identity theft protection starts here."
    },
    "podcast_summary": "In this podcast, the host discusses the potential signing of Wataru Endo by Liverpool. Endo is the captain of the Japanese national team and currently plays for Stuttgart. The host describes Endo as a natural leader and a defensive player with a strong presence on the pitch. They discuss his development from his youth career to becoming the captain of the national team. They also mention his performances for both his club and the national team, highlighting his importance in midfield and his ability to create chances. The host mentions that Endo is respected by fans, although he may not have the same fanatical following as some other Japanese players. They see his potential move to Liverpool as a significant accomplishment for Japanese football. Overall, Endo's leadership, defensive skills, and midfield presence make him an attractive signing for Liverpool.",
    "podcast_guest": {
        "name": "Not Available",
        "org": "Not Available",
        "title": "Not Available",
        "summary": "Not Available"
    },
    "podcast_highlights": "- Highlight 1: \"He's just got this presence, he's unflappable.\"\n- Highlight 2: \"He's not a star, but he's a core component.\"\n- Highlight 3: \"I think anyone who's paying attention to this team understands how important he is.\"\n- Highlight 4: \"He's taken over the captain's position at the Rio Olympics in 2016.\"\n- Highlight 5: \"He's just got that sense of leadership.\""
}